re-former/app/controllers/users_controller.rb

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "sshsahsh"], ["updated_at", "2021-03-07 21:23:33.007292"], ["id", 1]]